{
  "backend/main.mo": "Actor manages user profiles and owned patterns with access control, including CRUD operations and permission checks.",
  "backend/pattern.mo": "Defines pattern data types, ownership wrapper, and a comparator for sorting by creation time.",
  "feature_evidence.json": "Lists features, involved files, components, and test IDs for feature evidence tracking.",
  "frontend/docs/architecture.md": "Begins describing the system architecture overview for the application.",
  "frontend/docs/controller-protocol.md": "Documents machine control commands, formats, examples, and status endpoint details.",
  "frontend/docs/error-handling.md": "Explains error categories, handling strategies, UX behavior, and recovery flows.",
  "frontend/docs/gcode-generation.md": "Outlines client-side deterministic G‑code generation sources and pipeline intro.",
  "frontend/docs/README.md": "Top-level documentation index describing app purpose, structure, features, and quick start steps.",
  "frontend/docs/ui-breakdown.md": "Provides an overview of UI screens starting with the Pattern Gallery.",
  "frontend/index.css": "Tailwind-based global theme variables for light/dark mode and component styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main script.",
  "frontend/src/App.tsx": "Sets up routing, theme provider, and global toaster wrapped by the AppShell layout.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting authenticated users without a profile to enter and save their name.",
  "frontend/src/components/branding/AppLogo.tsx": "Renders the app logo inside a styled container with a gradient background.",
  "frontend/src/components/connection/ConnectionForm.tsx": "Form for configuring HTTP/WebSocket URLs and testing or saving controller connection settings.",
  "frontend/src/components/connection/ConnectionStatusBadge.tsx": "Displays connection status with an icon and shows error details in a popover when present.",
  "frontend/src/components/creator/GCodePreviewPanel.tsx": "Shows G‑code text with options to download or send it to the controller.",
  "frontend/src/components/creator/ImageUploadVectorizer.tsx": "Uploads an image, shows a preview, and generates a simple simulated vector path.",
  "frontend/src/components/creator/PromptPatternGenerator.tsx": "Generates pattern paths based on text prompts like spiral, mandala, or geometric.",
  "frontend/src/components/creator/SketchCanvas.tsx": "Interactive canvas allowing users to draw freehand paths, with erase and clear controls.",
  "frontend/src/components/creator/SpeedScaleControls.tsx": "Sliders for adjusting playback speed and pattern scale percentages.",
  "frontend/src/components/dashboard/ErrorAlerts.tsx": "Displays a list of error messages with icons based on error type.",
  "frontend/src/components/dashboard/ProgressPanel.tsx": "Shows pattern execution progress using a progress bar and percentage label.",
  "frontend/src/components/dashboard/StatusCards.tsx": "Displays cards summarizing machine position, current pattern, state, and last update time.",
  "frontend/src/components/layout/AppShell.tsx": "Main application shell providing header, navigation, and global modals.",
  "frontend/src/components/led/BrightnessSlider.tsx": "Slider control for adjusting LED brightness percentage.",
  "frontend/src/components/led/ColorPicker.tsx": "Color picker allowing selection via color input or hex text field.",
  "frontend/src/components/led/LedControlPanel.tsx": "UI panel to control LED state, color, brightness, and mode, sending commands when settings change.",
  "frontend/src/components/led/LedModeSelector.tsx": "Dropdown for selecting LED animation modes with predefined options.",
  "frontend/src/components/navigation/PrimaryNav.tsx": "Mobile bottom navigation bar linking to main app sections with active-state highlighting.",
  "frontend/src/components/patterns/PatternGallery.tsx": "Displays searchable, sortable pattern tiles and handles empty results.",
  "frontend/src/components/patterns/PatternSourceTabs.tsx": "Two-tab layout switching between local and cloud patterns with login gating for cloud content.",
  "frontend/src/components/patterns/PatternTile.tsx": "Card-style tile showing pattern thumbnail, name, and duration, linking to the pattern detail page.",
  "frontend/src/components/preview/PatternPreview.tsx": "Wraps toolpath rendering and playback controls to preview a pattern visually.",
  "frontend/src/components/preview/PlaybackScrubber.tsx": "Playback slider with play/pause logic that updates preview progress over time.",
  "frontend/src/components/preview/ToolpathRenderer.tsx": "Canvas renderer that draws the full toolpath and highlights progress with a moving marker.",
  "frontend/src/components/run/RunControls.tsx": "Control panel for starting, pausing, stopping, homing, and retracing patterns with confirmation dialogs.",
  "frontend/src/components/safety/ConfirmDialog.tsx": "Reusable confirmation dialog with customizable title, description, and actions.",
  "frontend/src/components/safety/EmergencyStopFab.tsx": "Floating button that triggers an emergency stop after confirmation.",
  "frontend/src/components/safety/ResumePromptDialog.tsx": "Prompts the user to resume or stop a previously active pattern session based on saved state.",
  "frontend/src/components/theme/ThemeToggle.tsx": "A button component that toggles between light and dark themes using next-themes.",
  "frontend/src/controller/commandClient.ts": "Sends commands over HTTP and updates connection status and error state.",
  "frontend/src/controller/protocol.ts": "Defines command types and utilities for parsing and formatting LED and speed commands.",
  "frontend/src/controller/statusClient.ts": "Fetches machine status via HTTP with timeout handling and maps it to a normalized structure.",
  "frontend/src/controller/transports/httpTransport.ts": "Implements sending commands to the controller over HTTP with timeout and error handling.",
  "frontend/src/controller/transports/websocketTransport.ts": "Manages WebSocket connection, reconnection, message parsing, and command sending.",
  "frontend/src/data/samplePatterns.ts": "Provides sample pattern metadata and optional G-Code strings.",
  "frontend/src/gcode/gcodeGenerator.ts": "Generates G-code from a list of points with speed and scale adjustments.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useCommandClient.ts": "Exposes sendCommand and connection status from the connection store.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context, Internet Identity login/logout, and identity persistence.",
  "frontend/src/hooks/useMachineStatus.ts": "Polls machine status periodically using React Query when an HTTP URL is configured.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for managing user profiles and patterns via the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables for light and dark themes with sand-table-inspired palette.",
  "frontend/src/lib/utils.ts": "Utility for merging class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Initializes the app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CustomPatternCreatorPage.tsx": "UI for creating custom patterns via sketch, image, or prompts, with G-code preview and controls.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the live status dashboard, showing machine status, progress, and errors using data from useMachineStatus.",
  "frontend/src/pages/LedControlPage.tsx": "Displays a simple page wrapper containing the LED control panel UI.",
  "frontend/src/pages/PatternGalleryPage.tsx": "Loads cloud and local patterns, formats them, and displays them in a gallery with tabs and a loading state.",
  "frontend/src/pages/PatternRunPage.tsx": "Shows run controls and a preview for a selected pattern, generating a dummy preview path and displaying duration info.",
  "frontend/src/pages/SettingsConnectionPage.tsx": "Provides the connection settings page with a status badge and form for configuring controller URLs.",
  "frontend/src/state/connectionStore.ts": "Zustand store managing controller connection URLs, status, errors, and a testConnection method with persistence.",
  "frontend/src/state/ledPresetsStore.ts": "Zustand store for saving, retrieving, and deleting LED presets keyed by pattern ID with persistence.",
  "frontend/src/state/runSessionStore.ts": "Zustand store tracking the current pattern run session with setters and clearing, persisted to storage.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters with hash-routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, animations, and plugins.",
  "project_state.json": "Metadata describing the project’s state, features, architecture notes, and required assets."
}